In [139]:
from sklearn import datasets
from sklearn.linear_model import LogisticRegression
import numpy as np
import pandas as pd
import random as rd

In [162]:
titanic_train = pd.read_csv("train_titanic.csv" )
titanic_train = titanic_train.drop(columns = ['Name'])
t = titanic_train['Sex'].replace('female' , 0).replace('male',1)
titanic_train.drop(columns = ['Sex','Ticket','Cabin'] ,inplace = True) 
titanic_train.insert(1 ,'Sex' , t) 
titanic_train
titanic_train['Age'].fillna(titanic_train['Age'].mean() , inplace = True)
k = titanic_train['Embarked'].replace('S' , 0).replace('Q' , 1 ).replace('C' , 2 )
titanic_train['Embarked'] = k

titanic_train['Embarked'].fillna(rd.randint(0,2) , inplace = True)
(titanic_train['Parch']).fillna(rd.randint(min(titanic_train['Parch']) , max(titanic_train['Parch'])))
# print(titanic_train['Embarked'].isnull().sum())
titanic_train = titanic_train.to_numpy()
x_train = titanic_train[: , :-1]
y_train = titanic_train[: ,  -1]

0

In [151]:
titanic_train = pd.read_csv("train_titanic.csv" )
titanic_train

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,NaN,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,NaN,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,NaN,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,NaN,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,NaN,Q,1

In [168]:
titanic_test = pd.read_csv("test_titanic.csv" )
titanic_test.drop(columns = ['Name' , 'Ticket' , 'Cabin'] , inplace = True)
titanic_test['Age'].fillna(titanic_test['Age'].mean() , inplace = True)
sex = titanic_test['Sex'].replace('male' , 1).replace('female' , 0 )
titanic_test['Sex'] = sex

k = titanic_test['Embarked'].replace('S' , 0).replace('Q' , 1 ).replace('C' , 2 )
titanic_test['Embarked'] = k
titanic_test['Embarked'].fillna(rd.randint(0,2) , inplace = True)
(titanic_test['Parch']).fillna(rd.randint(min(titanic_test['Parch']) , max(titanic_test['Parch'])))
# print(titanic_test['Embarked'].isnull().sum())

titanic_test = titanic_test.to_numpy()
x_test = titanic_test

In [164]:
clf = LogisticRegression()
clf.fit(x_train , y_train )

LogisticRegression()

In [181]:
y_pred = clf.predict(x_test)
y_pred

array([0., 1., 0., 1., 0., 0., 0., 0., 1., 0., 1., 0., 1., 1., 0., 0., 0.,
       0., 0., 1., 1., 0., 1., 1., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0.,
       0., 1., 1., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1., 0., 0., 0.,
       1., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 1.,
       1., 0., 0., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0.,
       1., 1., 1., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 1., 1., 0.,
       1., 0., 1., 1., 0., 0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 1., 0.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       1., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 0.,
       0., 1., 0., 0., 1., 0., 0., 0., 1., 1., 1., 1., 0., 1., 0., 1., 1.,
       1., 1., 1., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 1.,
       0., 1., 0., 0., 0., 1., 0., 0., 1., 1., 1., 1., 1., 0., 1., 0., 0.,
       0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1.,
       0., 0.])

In [182]:
np.savetxt('LogicR_Titanic_prediction.csv', y_pred, delimiter=',')

In [176]:
clf.score(x_train , y_train)

0.7934131736526946

In [178]:
# clf.predict_proba(y_train , y_test)